Repository: MC-OS/dock
Catalog: po/*.po
Languages: ckb

source: Plank
ckb: پلانک

source: Stupidly simple.
ckb: سادەییەکی لە ڕادە بەدەر.

source: Plank is meant to be the simplest dock on the planet. The goal is to provide just what a dock needs and absolutely nothing more.
ckb: پلانک دەیەوێت ببێت بە سادەترین دۆک لەسەر ئەم هەسارەیە. ئامانجییەتی دۆکێک بە تایبەتمەندییە پێویستەکانەوە دابین بکات نەک شتی زیادە.

source: It is, however, a library which can be extended to create other dock programs with more advanced features. Thus, Plank is the underlying technology for Docky (starting in version 3.0.0) and aims to provide all the core features while Docky extends it to add fancier things like Docklets, painters, settings dialogs, etc.
ckb: هەرچەندە پلانک لایبرەرییەکە کە دەکرێت گەورەتر بکرێت و دۆکی تر لەسەر دروست بکرێت بە تایبەتمەندی ترەوە. بەم شێوەیە، پلانک تەکنەلۆجیای ژێرهێڵە بۆ دۆکی (لە وەشانی ٣.٠.٠ دەست پێ دەکات) و ئامانجی ئەوەیە کە هەموو تایبەتمەندییە سەرەکیەکان دابین بکات لە کاتێکدا دۆکی درێژی دەکاتەوە بۆ زیادکردنی شتە خەیاڵییەکانی وەک دۆکلێتس و ڕەنگکردن و دایەلۆگی ڕێکخستنەکان و هتد.

source: The Plank Developers
ckb: گەشەپێدەرانی پلانک

source: Dock
ckb: دۆک

source: Theme:
ckb: ڕووکار:

source: Position:
ckb: شوێنی دۆک:

source: Left
ckb: چەپ

source: Right
ckb: ڕاست

source: Top
ckb: سەرەوە

source: Bottom
ckb: خوارەوە

source: Alignment:
ckb: لاگرتن:

source: Fill
ckb: پڕ بە شاشە

source: Start
ckb: سەرەتاوە

source: End
ckb: کۆتاییەوە

source: Center
ckb: ناوەڕاست

source: On Primary Display:
ckb: پشاندان لەسەر شاشەی سەرەکی:

source: Offset in percent from the center of the screen-edge
ckb: ڕێژەی ئۆفسێت لە سەنتەری شاشەوە

source: Icon Alignment:
ckb: لاگرتنی ئایکۆنەکان:

source: Icon Size:
ckb: قەبارەی ئایکۆن:

source: Appearance
ckb: دەرکەوتن

source: Intellihide
ckb: شاردنەوەی خۆکارانەی زیرەک

source: Autohide
ckb: شاردنەوەی خۆکارانە

source: Dodge maximized window
ckb: گەورەبوونی پەنجەرەی کارا

source: Window Dodge
ckb: کە بنمیچی هەر پەنجەرەیەک بەر دۆک بکەوێت

source: Dodge active window
ckb: ئەگەر بنمیچی پەنجەرەی کارا بەر دۆک بکەوێت

source: Hide Dock
ckb: شاردنەوەی دۆک

source: Hide Delay:
ckb: دواکەوتنی دۆک:

source: Delay in ms before hiding the dock
ckb: مانەوەی دۆک لەسەر شاشە دوای دەرکەوتنی بە میلی چرکە

source: Unhide Delay:
ckb: پشاندانەوەی دۆک:

source: Delay in ms before showing the dock
ckb: پشاندانەوەی دۆک لە ماوەی چەند میلی چرکەیەکدا کاتێک نیشاندەری ماوس دەخەیتە سەری

source: Pressure Reveal:
ckb: دەرکەوتنەوەی بە فشاری نیشاندەری ماوس:

source: Item Management
ckb: بەڕێوەبردنی دانەکانی سەر دۆک

source: Show Unpinned:
ckb: پشاندانی نەچێسپێندراوکان:

source: Restrict to Workspace:
ckb: پابەندکردن بە ناوچەکارەوە:

source: Lock Icons:
ckb: قوفڵکردنی ئایکۆنەکان:

source: Behaviour
ckb: ڕەفتار

source: Docklets
ckb: دۆکلێتس

source: Applications
ckb: ئەپڵیکەیشنەکان

source: No battery
ckb: پاتری نییە

source: Battery
ckb: پاتری

source: Displays battery information
ckb: پشاندانی زانیاری پاتری

source: CPU Monitor
ckb: مۆنیتەری CPU

source: Keep an eye on that CPU. And when it gets out of line...
ckb: چاودێریکردنی CPU و ئاگاداربوونی...

source: Clipboard is currently empty.
ckb: لە ئێستادا کلیپبۆرد بەتاڵە.

source: _Clear
ckb: _سڕینەوە

source: Clippy
ckb: کلیپی

source: Keep recent clipboard entries.
ckb: هێشتنەوەی ئەو دەقانەی کە کۆپیت کردوون.

source: Di_gital Clock
ckb: کاتژمێری دیجیتاڵی

source: 24-Hour _Clock
ckb: دەمژمێری ٢٤ دەم

source: Show _Date
ckb: پشاندانی بەروار

source: Clock
ckb: دەمژمێر

source: What time is it?
ckb: دەمژمێر چەندە؟

source: Show Desktop
ckb: پشاندانی ڕوومێز

source: Desktop
ckb: ڕوومێز

source: Show your Desktop.
ckb: پشاندانی ڕوومێزەکەت.

source: No items in Trash
ckb: هیچ شتێک لە تەنەکەدا نییە

source: %u item in Trash
ckb: %u دانە لە تەنەکەدا

source: Drop to move to Trash
ckb: بەریدە بۆ خستنە ناو تەنەکە

source: _Open Trash
ckb: کردنەوەی تەنەکە

source: Empty _Trash
ckb: بەتاڵکردنی تەنەکە

source: Empty all items from Trash?
ckb: ڕەشکردنەوەی هەموو دانەکانی ناو تەنەکە؟

source: All items in the Trash will be permanently deleted.
ckb: هەموو دانەکانی ناو تەنەکە بۆ هەمیشە ڕەش دەبنەوە.

source: _Cancel
ckb: هەڵوەشاندنەوە

source: Trash
ckb: تەنەکە

source: Have a look at your trash!
ckb: سەیری تەنەکەکەت بکە!

source: Drop to add to dock
ckb: بەریدە بۆ زیادکردنی بۆ دۆک

source: translator-credits
ckb: وەرگێڕەکان

source: _Keep in Dock
ckb: هێشتنەوەی لە دۆکدا

source: _Close All
ckb: داخستنی هەموو

source: _Close
ckb: داخستن

source: Drop to open with %s
ckb: بەریدە بۆ کردنەوەی بە %s

source: _Open in File Browser
ckb: کردنەوەی لە بڕاوزەری پەڕگەدا

source: _Open
ckb: کردنەوە

source: Open Containing _Folder
ckb: کردنەوەی بوخچەی تێداهەڵگیراو

source: Drop applications or files here
ckb: ئەپڵیکەیشنەکان یان پەڕگەکان لێرە بەردەوە

source: Get _Help Online...
ckb: یارمەتی سەرهێڵ...

source: _Translate This Application...
ckb: ئەم ئەمە وەربگێڕە...

source: Preferences
ckb: ڕێکخستنەکان
